#!/usr/bin/env python  
# -*- coding: utf-8 -*-

"""
------------------------------------------------------------------------------------------------------------------------

@Author: Bamboo
@Email: bamboo8493@126.com
@Datetime: 2019/9/28 10:32
@Description: 系统模块  这个模块可供访问由解释器使用或维护的变量和与解释器进行交互的函数

------------------------------------------------------------------------------------------------------------------------

@Modifier: 
@Email: 
@Datetime: 2019/9/28 10:32
@Description: 

------------------------------------------------------------------------------------------------------------------------
"""

import sys

# 命令行参数 List，第一个元素是程序本身路径
# print(sys.argv)

# 退出程序，正常退出时exit(0)
# sys.exit()
# 获取Python解释程序的版本信息
print(sys.version)
# 最大的Int值
print(sys.maxsize)
# 获取导入模块时的路径，如果没有符合需要的，可以 append 你想要添加的路径
print(sys.path)
# 返回操作系统平台名称
print(sys.platform)

# 标准输入写入
sys.stdout.write('please:')
print(sys.stdin.readline()[:-1])