#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
------------------------------------------------------------------------------------------------------------------------

@Author: Bamboo
@Email: bamboo8493@126.com
@Datetime: 2019/10/6 14:46
@Description: 

------------------------------------------------------------------------------------------------------------------------

@Modifier: 
@Email: 
@Datetime: 2019/10/6 14:46
@Description: 

------------------------------------------------------------------------------------------------------------------------
"""

import pickle

# 注意：pickle 可以写入引用类型对象，但是在读取时读不到文件内部对象的内存数据，必须声明一个同名的函数才能读取(读的是声明对象)，不实用
def foo(): print('bar')

file = open('PICKLE_TEXT', 'rb')

# data = pickle.loads(file.read())

# 等同于
data = pickle.load(file)

file.close()
data()