#!/usr/bin/env python  
# -*- coding: utf-8 -*-

"""
------------------------------------------------------------------------------------------------------------------------

@Author: Bamboo
@Email: bamboo8493@126.com
@Datetime: 2019/8/22 9:53
@Description: 在文件内容最后进行追加写操作

------------------------------------------------------------------------------------------------------------------------

@Modifier: 
@Email: 
@Datetime: 2019/8/22 9:53
@Description: 

------------------------------------------------------------------------------------------------------------------------
"""

# open 打开文件，第一个参数：文件路径，第二个参数：模式（a追加写），第三个参数：读取编码
# 以写模式打开文件时，如果文件存在，则在文件内容后面追加新内容，如果文件不存在，则创建新文件
file = open('append.txt', 'a', encoding='utf-8')

# 读取文件，参数：要写进文件的数据
file.write('\nthis is append content!\n')
file.write('I am Bamboo')

# 关闭文件
file.close()